In [1]:
#Importing the necessary libraries
import pandas as pd

In [4]:
#Loading the dataset
data = pd.read_csv('D:\\SLIIT\\3rd year 2nd sem\\Fundamentals of Data Mining\\Coding\\Cupcakes_duplicates.csv')
data.head(10)

      Mese  Cupcake
0  2004-01        5
1  2004-01        5
2  2004-01        5
3  2004-02        5
4  2004-03        4
5  2004-04        6
6  2004-05        5
7  2004-06        6
8  2004-07        6
9  2004-08        5

In [5]:
data.describe()

          Cupcake
count  210.000000
mean    48.700000
std     28.382563
min      4.000000
25%     24.000000
50%     50.000000
75%     72.000000
max    100.000000

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 210 entries, 0 to 209
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Mese     210 non-null    object
 1   Cupcake  210 non-null    int64
dtypes: int64(1), object(1)
memory usage: 3.4+ KB

In [7]:
(data.isna().sum() / len(data)) * 100

Mese       0.0
Cupcake    0.0
dtype: float64

In [8]:
data.shape

(210, 2)

In [9]:
#Checking for duplicates
data.duplicated()

0      False
1       True
2       True
3      False
4      False
       ...
205    False
206    False
207    False
208    False
209    False
Length: 210, dtype: bool

In [10]:
data.duplicated(subset=['Mese'])

0      False
1       True
2       True
3      False
4      False
       ...
205    False
206    False
207    False
208    False
209    False
Length: 210, dtype: bool

In [11]:
data.duplicated().sum()

6

In [12]:
#Dropping the duplicates
data1 = data.drop_duplicates()

In [14]:
data1.shape

(204, 2)

In [15]:
data1.head()

      Mese  Cupcake
0  2004-01        5
3  2004-02        5
4  2004-03        4
5  2004-04        6
6  2004-05        5

In [17]:
data2 = data.drop_duplicates(keep=False) ##keep parameter determines which duplicates to be kept.
data2.head()

      Mese  Cupcake
3  2004-02        5
4  2004-03        4
5  2004-04        6
6  2004-05        5
7  2004-06        6

In [18]:
data2.shape

(201, 2)

In [19]:
data3 =  data.drop_duplicates(subset=["Cupcake"])
data3.shape

(78, 2)

In [20]:
data3.head()

       Mese  Cupcake
0   2004-01        5
4   2004-03        4
5   2004-04        6
11  2004-10       10
12  2004-11        7